`Run cd $GITHUB_WORKSPACE/terraform/project/tier_1
  cd $GITHUB_WORKSPACE/terraform/project/tier_1
  terraform plan
  shell: /bin/bash --noprofile --norc -e -o pipefail {0}
  env:
    TERRAFORM_CLI_PATH: /home/actionbronson/actions-runner/_work/_temp/7788e215-4ae7-4248-97bb-48d2ecf4d668
/home/actionbronson/actions-runner/_work/_temp/7788e215-4ae7-4248-97bb-48d2ecf4d668/terraform-bin plan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vultr_firewall_group.pt_group will be created
  + resource "vultr_firewall_group" "pt_group" {
      + date_created   = (known after apply)
      + date_modified  = (known after apply)
      + description    = "pt-firewall"
      + id             = (known after apply)
      + instance_count = (known after apply)
      + max_rule_count = (known after apply)
      + rule_count     = (known after apply)
    }

  # vultr_firewall_rule.ssh_rule_definition will be created
  + resource "vultr_firewall_rule" "ssh_rule_definition" {
      + firewall_group_id = (known after apply)
      + id                = (known after apply)
      + ip_type           = "v4"
      + port              = "22"
      + protocol          = "tcp"
      + subnet            = "1.2.3.4"
      + subnet_size       = 32
    }

  # vultr_reserved_ip.pt_ip_001 will be created
  + resource "vultr_reserved_ip" "pt_ip_001" {
      + id          = (known after apply)
      + ip_type     = "v4"
      + label       = "pt_ip_001"
      + region      = "sea"
      + subnet      = (known after apply)
      + subnet_size = (known after apply)
    }

  # vultr_ssh_key.pt_hf will be created
  + resource "vultr_ssh_key" "pt_hf" {
      + date_created = (known after apply)
      + id           = (known after apply)
      + name         = "pt-key"
      + ssh_key      = "foobar"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
`